       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello_world.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(3).
       01 NUM2 PIC 9(3).
       01 NUM3 PIC 9(3).

       PROCEDURE DIVISION.
         DISPLAY "Hello World".
       STOP RUN.
